OpenAtomFoundation/TobudOS/board/STM8L052R8T6/LIB/src/stm8l15x_lcd.c
  LCD->CR2 &= (uint8_t)(~LCD_CR2_VSEL);    /* Clear the voltage source bit */
  LCD->CR2 |= LCD_VoltageSource;

}

/**
  * @brief  Configures the LCD Port Mask.
  * @param  LCD_PortMaskRegister: The LCD register index in the port mask matrix.
  *          This parameter can be one of the following values:
  *            @arg LCD_PortMaskRegister_0: PortMask Register 0  
  *            @arg LCD_PortMaskRegister_1: PortMask Register 1
  *            @arg LCD_PortMaskRegister_2: PortMask Register 2
  *            @arg LCD_PortMaskRegister_3: PortMask Register 3
  *            @arg LCD_PortMaskRegister_4: PortMask Register 4
  *            @arg LCD_PortMaskRegister_5: PortMask Register 5        
  * @param  LCD_Mask : Value to be written
  * @retval None
  */
void LCD_PortMaskConfig(LCD_PortMaskRegister_TypeDef LCD_PortMaskRegister, uint8_t LCD_Mask)
{
  /* Check function parameters */
  assert_param(IS_LCD_PORT_MASK(LCD_PortMaskRegister));

  /* Copy data bytes to Port mask register */
  LCD->PM[LCD_PortMaskRegister] =  LCD_Mask;

}

/**
  * @brief  Enables or disables the LCD Controller.
  * @param  NewState: new state of the LCD peripheral.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  * @retval None
  */
void LCD_Cmd(FunctionalState NewState)
{
  /* Check function parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    LCD->CR3 |= LCD_CR3_LCDEN; /* Enable the LCD peripheral*/
  }
  else
  {
    LCD->CR3 &= (uint8_t)(~LCD_CR3_LCDEN); /* Disable the LCD peripheral*/
  }
}

/**
  * @brief  Enables or disables the low resistance divider. Displays with high 
  *         internal resistance may need a longer drive time to achieve 
  *         satisfactory contrast. This function is useful in this case if some 
  *         additional power consumption can be tolerated.
  * @note   When this mode is enabled, the PulseOn Duration (PON) have to be 
  *         programmed to 1/CK_PS (LCD_PulseOnDuration_1).    
  * @param  NewState: new state of the low resistance divider.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void LCD_HighDriveCmd(FunctionalState NewState)
{
  /* Check function parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    LCD->CR2 |= LCD_CR2_HD; /* Permanently enable low resistance divider */
  }
  else
  {
    LCD->CR2 &= (uint8_t)(~LCD_CR2_HD); /* Permanently disable low resistance divider */
  }
}

/**
  * @brief  Configures the LCD pulses on duration.
  * @param  LCD_PulseOnDuration: specifies the LCD pulse on duration in terms of 
  *         CLKprescaler (prescaled LCD clock period) pulses.
  *          This parameter can be one of the following values:
  *            @arg LCD_PulseOnDuration_0: 0 pulse
  *            @arg LCD_PulseOnDuration_1: Pulse ON duration = 1/CLKprescaler
  *            @arg LCD_PulseOnDuration_2: Pulse ON duration = 2/CLKprescaler
  *            @arg LCD_PulseOnDuration_3: Pulse ON duration = 3/CLKprescaler
  *            @arg LCD_PulseOnDuration_4: Pulse ON duration = 4/CLKprescaler
  *            @arg LCD_PulseOnDuration_5: Pulse ON duration = 5/CLKprescaler
  *            @arg LCD_PulseOnDuration_6: Pulse ON duration = 6/CLKprescaler
  *            @arg LCD_PulseOnDuration_7: Pulse ON duration = 7/CLKprescaler
  * @retval None
  */
void LCD_PulseOnDurationConfig(LCD_PulseOnDuration_TypeDef LCD_PulseOnDuration)
{
  /* Check function parameters */
  assert_param(IS_LCD_PULSE_DURATION(LCD_PulseOnDuration));

  LCD->CR2 &= (uint8_t)(~LCD_CR2_PON); /* Clear the pulses on duration bits */
  LCD->CR2 |= LCD_PulseOnDuration;
}

/**
  * @brief  Configures the LCD dead time.
  * @param  LCD_DeadTime: specifies the LCD dead time.
  *          This parameter can be one of the following values:
  *            @arg LCD_DeadTime_0: No dead Time
  *            @arg LCD_DeadTime_1: One Phase between different couple of Frame
  *            @arg LCD_DeadTime_2: Two Phase between different couple of Frame
  *            @arg LCD_DeadTime_3: Three Phase between different couple of Frame
  *            @arg LCD_DeadTime_4: Four Phase between different couple of Frame
  *            @arg LCD_DeadTime_5: Five Phase between different couple of Frame
  *            @arg LCD_DeadTime_6: Six Phase between different couple of Frame 
  *            @arg LCD_DeadTime_7: Seven Phase between different couple of Frame
  * @retval None
  */
void LCD_DeadTimeConfig(LCD_DeadTime_TypeDef LCD_DeadTime)
{
  /* Check function parameters */
  assert_param(IS_LCD_DEAD_TIME(LCD_DeadTime));

  LCD->CR3 &= (uint8_t)(~LCD_CR3_DEAD);  /* Clear the dead time bits  */

  LCD->CR3 |= LCD_DeadTime;

}

/**
  * @brief  Configures the LCD Blink mode and Blink frequency.
  * @param  LCD_BlinkMode: specifies the LCD blink mode.
  *          This parameter can be one of the following values:
  *            @arg LCD_BlinkMode_Off:           Blink disabled
  *            @arg LCD_BlinkMode_SEG0_COM0:     Blink enabled on SEG[0], COM[0] (1 pixel)
  *            @arg LCD_BlinkMode_SEG0_AllCOM:   Blink enabled on SEG[0], all COM (up to 8 
  *                                       pixels according to the programmed duty)
  *            @arg LCD_BlinkMode_AllSEG_AllCOM: Blink enabled on all SEG and all COM 
  *                                       (all pixels)
  * @param  LCD_BlinkFrequency: specifies the LCD blink frequency.
  *          This parameter can be one of the following values:
  *            @arg LCD_BlinkFrequency_Div8:    The Blink frequency = fLcd/8
  *            @arg LCD_BlinkFrequency_Div16:   The Blink frequency = fLcd/16
  *            @arg LCD_BlinkFrequency_Div32:   The Blink frequency = fLcd/32
  *            @arg LCD_BlinkFrequency_Div64:   The Blink frequency = fLcd/64 
  *            @arg LCD_BlinkFrequency_Div128:  The Blink frequency = fLcd/128
  *            @arg LCD_BlinkFrequency_Div256:  The Blink frequency = fLcd/256
  *            @arg LCD_BlinkFrequency_Div512:  The Blink frequency = fLcd/512
  *            @arg LCD_BlinkFrequency_Div1024: The Blink frequency = fLcd/1024
  * @retval None
  */
void LCD_BlinkConfig(LCD_BlinkMode_TypeDef LCD_BlinkMode, LCD_BlinkFrequency_TypeDef LCD_BlinkFrequency)
{
  /* Check function parameters */
  assert_param(IS_LCD_BLINK_MODE(LCD_BlinkMode));
  assert_param(IS_LCD_BLINK_FREQUENCY(LCD_BlinkFrequency));

  LCD->CR1 &= (uint8_t)(~LCD_CR1_BLINK); /* Clear the blink mode bits */
  LCD->CR1 |= LCD_BlinkMode; /* Config the LCD Blink Mode */

  LCD->CR1 &= (uint8_t)(~LCD_CR1_BLINKF); /* Clear the blink frequency bits */
  LCD->CR1 |= LCD_BlinkFrequency; /* Config the LCD Blink Frequency */

